# -*- coding=utf-8 -*-
import time

import pyautogui
import random

screenWidth, screenHeight = pyautogui.size()
pyautogui.FAILSAFE
print(screenWidth)
print(screenHeight)

# 设置随机的点击间隔时间，以模拟人工点击
interval = random.uniform(0.5, 1.5)


def play():
    pyautogui.moveTo(start, duration=1)
    pyautogui.click(clicks=1, interval=interval)


def to_click(_x, _y, _duration):
    # 先定位链接的位置
    # link_position = (_x, _y)
    # 然后模拟鼠标移动到链接位置
    pyautogui.moveTo((_x, _y), duration=1)

    # 模拟单次点击
    pyautogui.click(clicks=1, interval=interval)
    # 鼠标滚轮向上滚动10个单位
    # pyautogui.scroll(10)
    # 播放视频
    if _duration != 0:
        play()

    time.sleep(_duration * 60)


x = 1000
y = 400
start = (771, 556)

v_list = {
    1: (1348, 407, 45), 2: (1348, 429, 36), 3: (1348, 456, 39), 4: (1348, 472, 39), 5: (1348, 499, 40),
    6: (1348, 527, 42),
    7: (1348, 368, 0), 8: (1348, 404, 0),  # 习近平新时代
    9: (1348, 433, 37), 10: (1348, 459, 40), 11: (1348, 484, 37),
    12: (1270, 404, 0), 13: (1270, 438, 0),  # 深谈大国
    14: (1348, 466, 34), 15: (1348, 491, 31), 16: (1348, 518, 39), 17: (1348, 543, 38),
    18: (1270, 438, 0), 19: (1270, 473, 0),  # 网络安全
    20: (1348, 504, 34), 21: (1348, 528, 34), 22: (1348, 555, 39),
    23: (1270, 473, 0), 25: (1270, 506, 0),  # 数字技术
    26: (1348, 539, 44), 27: (1348, 565, 41),
    28: (1270, 506, 0), 29: (1270, 540, 0),  # 应急救援
    30: (1348, 576, 49), 31: (1348, 595, 53),
    32: (1270, 540, 0), 33: (1270, 576, 0),  # 安全生产
    34: (1270, 605, 38), 35: (1270, 629, 44), 36: (1270, 654, 37),
    37: (1270, 576, 0), 38: (1270, 610, 0),  # 知识产权
    39: (1348, 642, 51), 40: (1348, 666, 47),
    41: (1270, 610, 0), 42: (1270, 640, 0),  # 创新创业
    43: (1348, 670, 43), 44: (1348, 698, 41), 45: (1348, 723, 41),
    46: (1270, 640, 0), 47: (1270, 677, 0),  # 十四五”规划
    48: (1348, 714, 47), 49: (1348, 734, 60),
    50: (1270, 677, 0), 51: (1270, 719, 0),  # “三抓三促”
    52: (1348, 742, 48)
}
if __name__ == '__main__':
    for k, v in v_list.items():

        x = v[0]
        y = v[1]
        tduration = v[2]
        if k >= 34:
            print("播放序号：", k)
            to_click(x, y, tduration)

    print("done-------------")
